## PRUEBAS CON DATAFRAME DE PANDAS

In [7]:
import numpy as np
import pandas as pd
from pandas import DataFrame
from random import randint

In [2]:
m = np.random.randint(1,50, 30).reshape(5,6)
df1 = DataFrame(m)
df1

    0   1   2   3   4   5
0  29  49  11   6  13  17
1  39  11  28  20  19   1
2  23  25  36  24  49   3
3  40  42   7  31   6  36
4  28  36  45  16  36  45

In [4]:
df1.columns=['a','b','c','d','e','f']
df1

    a   b   c   d   e   f
0  29  49  11   6  13  17
1  39  11  28  20  19   1
2  23  25  36  24  49   3
3  40  42   7  31   6  36
4  28  36  45  16  36  45

In [5]:
d = {"pais":['España','Italia','Alemania'], "hab":[36, 50, 34]}
df2 = DataFrame(d)
df2

       pais  hab
0    España   36
1    Italia   50
2  Alemania   34

In [9]:
d = {i:[randint(1,50) for  _ in range(5)] for i in "hola"}
df3 = DataFrame(d)
df3

    h   o   l   a
0  40  25  38   9
1  32  12  17  44
2  48  38   1  45
3  50  43  32  33
4  45  32   7  45

Acceso a los elementos: filas, columnas o celdas

In [11]:
# Una columna
df3['o']

0    25
1    12
2    38
3    43
4    32
Name: o, dtype: int64

In [12]:
type(df3['o'])

pandas.core.series.Series

In [14]:
# una fila:
df3.loc[2]

h    48
o    38
l     1
a    45
Name: 2, dtype: int64

In [15]:
df3['a'][1]

44

In [16]:
df3.loc[1]['a']

44

In [17]:
df3['a'][1] = 4000
df3

    h   o   l     a
0  40  25  38     9
1  32  12  17  4000
2  48  38   1    45
3  50  43  32    33
4  45  32   7    45

In [18]:
df3[df3 == 45]

      h   o   l     a
0   NaN NaN NaN   NaN
1   NaN NaN NaN   NaN
2   NaN NaN NaN  45.0
3   NaN NaN NaN   NaN
4  45.0 NaN NaN  45.0

In [19]:
df3[df3 == 45].count()

h    1
o    0
l    0
a    2
dtype: int64

In [20]:
df3[df3 == 45].count(1)

0    0
1    0
2    1
3    0
4    2
dtype: int64

In [22]:
df3.value_counts()

h   o   l   a
32  12  17  4000    1
40  25  38  9       1
45  32  7   45      1
48  38  1   45      1
50  43  32  33      1
Name: count, dtype: int64

In [25]:
(df3 == 45).sum()

h    1
o    0
l    0
a    2
dtype: int64

In [26]:
(df3 == 45).sum(1)

0    0
1    0
2    1
3    0
4    2
dtype: int64

In [28]:
df3.isin([45])

       h      o      l      a
0  False  False  False  False
1  False  False  False  False
2  False  False  False   True
3  False  False  False  False
4   True  False  False   True

In [30]:
df3.h.isin([45])

0    False
1    False
2    False
3    False
4     True
Name: h, dtype: bool

In [42]:
df3['h'].isin([45])

0    False
1    False
2    False
3    False
4     True
Name: h, dtype: bool

In [39]:
s = df3[df3.isin([45])].stack()
s

2  a    45.0
4  h    45.0
   a    45.0
dtype: float64

In [40]:
type(s)

pandas.core.series.Series

In [41]:
L = list(s.index)
L

[(2, 'a'), (4, 'h'), (4, 'a')]

In [43]:
path = '../practicas/Analisis Datos/merge/'

In [44]:
df = pd.read_csv(path+'Pedidos.txt', sep=';')
df.head()

   idpedido cliente  idempleado  idempresa  importe       pais
0     10248   WILMK           5          3    32.38  Finlandia
1     10249   TOMSP           6          1    11.61   Alemania
2     10250   HANAR           4          2    65.83     Brasil
3     10251   VICTE           3          1    41.34    Francia
4     10252   SUPRD           4          2    51.30    Belgica

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   idpedido    830 non-null    int64
 1   cliente     830 non-null    object
 2   idempleado  830 non-null    int64
 3   idempresa   830 non-null    int64
 4   importe     830 non-null    float64
 5   pais        830 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 39.0+ KB

In [46]:
df.describe()

           idpedido  idempleado   idempresa      importe
count    830.000000  830.000000  830.000000   830.000000
mean   10662.500000    4.403614    2.008434    78.244205
std      239.744656    2.499648    0.778899   116.779294
min    10248.000000    1.000000    1.000000     0.020000
25%    10455.250000    2.000000    1.000000    13.380000
50%    10662.500000    4.000000    2.000000    41.360000
75%    10869.750000    7.000000    3.000000    91.430000
max    11077.000000    9.000000    3.000000  1007.640000

In [48]:
df.pais.value_counts()

pais
Estados Unidos    123
Alemania          122
Brasil             83
Francia            76
Reino Unido        55
Venezuela          46
Austria            40
Suecia             38
Canada             30
Mexico             28
Italia             28
Espanya            23
Finlandia          23
Irlanda            19
Belgica            19
Suiza              18
Dinamarca          18
Argentina          16
Portugal           13
Polonia             6
Noruega             6
Name: count, dtype: int64

In [49]:
df[df.pais=='Polonia']

     idpedido cliente  idempleado  idempresa  importe     pais
126     10374   WOLZA           1          3     3.94  Polonia
363     10611   WOLZA           6          2    80.65  Polonia
544     10792   WOLZA           1          3    23.79  Polonia
658     10906   WOLZA           4          3    26.29  Polonia
750     10998   WOLZA           8          2    20.31  Polonia
796     11044   WOLZA           4          1     8.72  Polonia

In [51]:
df[(df.pais=='Polonia') & (df.importe > 20) & (df.importe < 30)]

     idpedido cliente  idempleado  idempresa  importe     pais
544     10792   WOLZA           1          3    23.79  Polonia
658     10906   WOLZA           4          3    26.29  Polonia
750     10998   WOLZA           8          2    20.31  Polonia

In [56]:
# Filtrar pedidos de Polonia y exportar a un fichero CSV:
df[df.pais=='Polonia'].to_csv(path+"paises/polonia.csv", sep=';', index=False, decimal=',')

In [57]:
L = list(df.pais.unique())
L.sort()
L

['Alemania',
 'Argentina',
 'Austria',
 'Belgica',
 'Brasil',
 'Canada',
 'Dinamarca',
 'Espanya',
 'Estados Unidos',
 'Finlandia',
 'Francia',
 'Irlanda',
 'Italia',
 'Mexico',
 'Noruega',
 'Polonia',
 'Portugal',
 'Reino Unido',
 'Suecia',
 'Suiza',
 'Venezuela']